'''
Minecraft命令行工具来自MCC开发者团队，Mirence对其源码进行了部分修改以适配该MCCGUI程序

v0.1    实现账户的添加、删除和账户启动
v0.2    实现账户信息的编辑功能
v0.3    1.改用多进程启动MCC，实现正常向MCC输入文本；
        3.实现向服务器发送命令或消息；
        4.统一文字编码，将所有文字改为中文。
v0.3.1  1.仅在MCC进程启动时可以发送消息，仅未启动时可以编辑和删除账户；
        2.MCC子进程异常关闭（非手动退出）时会自动同步关闭状态和按键；
v0.4    1.采用多线程实现监听MCC输出;
        2.发送功能升级为输入输出窗口,可以发送消息的同时还可以查看MCC的输出内容（包括服务器内消息）；
v0.4.1  1.监听窗口始终可以打开，且窗口打开时可以操作主窗口;
        2.每个账户只能打开一个监听窗口，当打开已打开的监听窗口时，会将监听窗口重新显示在屏幕顶层并聚焦；
        3.可以同时打开多个账户的监听窗口。
        4.过滤原MCC输出中的ANSI转移符。
v0.4.2  1.修复了反复打开各个窗口的内存泄漏问题；
        2.监听内容会输出到日志并保存；
        3.在控制窗口加入控制栏，包含启动/退出键，未来可加入更多功能；
        4.监听窗口升级为控制窗口，关闭窗口后能够继续监听MCC的输出，重新打开后会读取日志恢复先前内容，同时显示关闭窗口期间监听的内容；
        5.MCC未启动时、发送消息为空时无法发送。
v0.4.3  1.控制窗口内的启动按键可正常使用；
        2.能够分辨MCC的报错输出、普通输出和服务器消息输出；
        3.MCC报错后会立刻关闭该进程；
v0.5    1.新增掉线自动重连功能：重新连接服务器若干次，仍然连接不成功后将会关闭进程，仅账户在线期间掉线可以触发重连，启动时的连接失败不会触发重连；
        2.控制界面新增“重连”按钮：点击后会直接重启MCC；
        3.优化监听窗口的内容显示：当滚动条处于最低处时会向下自动显示新的消息内容，否则保持不动。
        4.内存优化：MCC重新启动时若上一个相同进程未关闭，则会强制关闭。
v0.5.1  1.在控制窗口界面按下回车键可以发送内容；
        2.发送消息后监听窗口滚动条将移到最低处;
        3.打开监听窗口会会自动聚焦到消息发送文本框。
v0.6    1.新增重生功能：死亡状态下“重生”按钮亮起，点击“重生”按钮可以重生；
        2.新增假人状态显示窗口：可以显示假人当前的存活状态、生命值、饥饿值、经验值与经验等级；
        3.报错退出优化：采用了MCC自带的报错关闭进程的机制；
        4.重连按钮优化：仅进程开启时可以进行重连。
v0.6.1  1.新增发送消息缓存功能：发送过的消息或命令会被缓存（关闭程序后会清空），按下按键“↑”或“↓”可以快速输入之前输入过的内容。
        2.打开已关闭的控制窗口时会将监听窗口的滚动条移动至最下方；
        3.修复了重连和退出游戏后假人状态不变的问题，现在假人不在线时状态显示均为未知；
v0.6.2  1.修复了发布版本在window系统下的MCC子进程无法被正确创建的问题；
        2.隐藏了发布版本的MCC自身弹出的命令行窗口；
        3.设计了MCCGUI的初代图标。
v0.6.3  1.修复了多种情况下交互子进程和MCC子进程未能正确关闭的问题（包括但不限于强制关闭MCC、重连、关闭主程序）；
        2.监听窗口和日志内添加了更多的调试信息（[MCCGUI]开头的消息)。
v0.6.4  1.新增服务器连通性检测：在账户信息界面会显示认证服务器和游戏服务器的连通性信息，包括网络延迟、连接超时、未知的主机等；
        2.主页新增刷新按钮：点击“刷新”按钮后可以重新进行一次连通性测试，并更新连通性信息。
v0.7    新增功能：
        1.登录方式：
            ①新增离线登录方式：可以使用自定义的离线账户登录服务器；
            ②更改正版登录方式：为保护用户数据，正版账户启动后需要跳转到浏览器进行登录，后续启动可直接登录（开启会话缓存后仅需登录一次）；√
        2.控制窗口：
            ①新增彩色消息显示：解析MCC的ANSI转义符，监听窗口可以显示游戏内大部分带颜色和样式的消息；
            ②监听窗口背景颜色变化：监听窗口的背景颜色改为黑色，以更好地显示彩色信息；  
        3.添加和编辑账户窗口：
            ①新增常规设置：原先的内容属于常规设置内容，此外还可以可以指定游戏服务器和认证服务器端口，不填表示自动解析； 
            ②新增高级设置：可以为账户设置更多的MCC高级配置信息； 
            ③账户信息保护：编辑账户时将不再显示先前的密码，编辑时密码栏若留空则表示不修改密码。 
        优化内容：
        1.优化代码结构，提高代码可读性；
        2.改用数据库存储账户数据；
        3.第三方认证账户的密码采用双向加密方式存储（无法保证绝对安全）；
        4.日志存储时将直接存储带ANSI转义字符的内容，以便重新打开控制窗口后读取日志文字的样式信息；
        5.采用的专用的TOML相关库修改MCC的配置文件； 
        6.编辑窗口类直接继承添加账户窗口类； 
        7.创建新账户时不会再生成新的MCC本体，而是只生成配置文件，各个账户共用一个MCC程序，降低空间占用；    
        8.删除账户后会将配置文件一同删除；  
        9.为保护第三方认证账户的账户信息，每次关闭账户后会清空配置文件内密码部分的内容。 
        10.日志文件将在每一次启动账户后重新创建，每一次关闭账户后自动释放；
        修复内容：
        1.修复了控制窗口打开时启动或重连后无法与MCC进行交互的问题（包括无法接受假人状态、无法发送消息等）；      
        2.修复了正在进入服务器时无法正确接收账户状态从而异常显示在监听窗口的问题。  
v0.7.1  优化内容：
        1.优化新增、删除、编辑账户时刷新账户列表的行为；√
        2.优化了连通性测试，对于出现超过一次的IP地址只会进行一次连通性测试；
        漏洞修复：
        1.修复了新增、删除、编辑账户后由于刷新导致原先已打开的控制窗口失效的问题； √
        2.修复了进行连通性测试时游戏服务器在完成测试后一段时间内突然变成连接超时的问题；√
v0.8    新增功能：
        1.新增自定义快捷指令功能：
            用户可以设置快捷指令，实现一次性向服务器发送一条或多条消息和命令（发送频率受高级设置中的消息发送频率影响），快捷指令将保存在快捷指令仓库中；
            ·简单快捷指令：设置预设时的内容固定，执行时按照预设内容向服务器发送一条或多条服务器消息和命令；
            ·复杂快捷指令：设置预设时内容可以包含自变量，执行时将由用户决定如何替换预设的指定内容，确定后即可向服务器发送消息或命令。
        2.控制窗口新增快捷指令按钮：可以在快捷指令仓库中选择一个为该账户执行；
        3.控制窗口新增快捷指令栏：可以将部分快捷指令的触发按钮直接添加到控制窗口，更加便捷地启动相应快捷指令；

        芒果方块粉丝服定制版：
        1.新增专属的芒果方块粉丝服快捷指令仓库，包含多种以芒果方块粉丝服内命令为预设的快捷指令（该仓库由开发者提供，用户无法修改）；
        2.控制窗口内新增专属的芒果方块粉丝服快捷指令栏，可以添加芒果方块粉丝服快捷指令仓库内的指令。

         
'''

from multiprocessing import freeze_support
from tkinter import *
import os

from mccgui import run
from __version__ import __version__, MangoCraft

#代码文件名
FILE_NAME = os.path.basename(__file__) 

if __name__=="__main__":
    print(f"[DEBUG:{FILE_NAME}]主进程MCCGUI_v{__version__} {"for MangoCraft" if MangoCraft else ""}（{os.getpid()}）已启动。")
    freeze_support()
    app = run()
    mainloop()
